FemDesign.Geometry.Contour
contour_type

FemDesign.Geometry.Contour.LocalZ
Get LocalZ of Contour by analysing the direction of the contour.

FemDesign.Geometry.Contour.#ctor
Parameterless constructor for serialization.

FemDesign.Geometry.Contour.#ctor(System.Collections.Generic.List{FemDesign.Geometry.Edge})
Construct Contour from Edges.
Edges should form a closed contour.

FemDesign.Geometry.Contour.Reverse
Reverse direction of edges in this contour